# `nlargest` and `nsmallest`

In [11]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [12]:
np.random.seed(0)
s = Series(np.random.randint(0, 1000, 10),
           index=list('abcdefghij'))
s

a    684
b    559
c    629
d    192
e    835
f    763
g    707
h    359
i      9
j    723
dtype: int64

In [15]:
# what are the three largest numbers in s?

s.sort_values().tail(3)

j    723
f    763
e    835
dtype: int64

In [16]:
s.sort_values(ascending=False).head(3)

e    835
f    763
j    723
dtype: int64

In [17]:
# what if I want the four smallest values?

s.sort_values().head(4)

i      9
d    192
h    359
b    559
dtype: int64

In [18]:
# we can turn that around, too

s.sort_values(ascending=False).tail(4)

b    559
h    359
d    192
i      9
dtype: int64

In [19]:
s.nlargest(3)

e    835
f    763
j    723
dtype: int64

In [20]:
s.nsmallest(4)

i      9
d    192
h    359
b    559
dtype: int64

In [21]:
s.nlargest()

e    835
f    763
j    723
g    707
a    684
dtype: int64

In [22]:
np.random.seed(0)
df = DataFrame(np.random.randint(0, 1000, [6, 6]),
               index=list('abcdef'),
               columns=list('uvwxyz'))
df

     u    v    w    x    y    z
a  684  559  629  192  835  763
b  707  359    9  723  277  754
c  804  599   70  472  600  396
d  314  705  486  551   87  174
e  600  849  677  537  845   72
f  777  916  115  976  755  709

In [23]:
df.nlargest(3)

TypeError: DataFrame.nlargest() missing 1 required positional argument: 'columns'

In [24]:
df.nlargest(3, columns='x')

     u    v    w    x    y    z
f  777  916  115  976  755  709
b  707  359    9  723  277  754
d  314  705  486  551   87  174

In [25]:
df.loc['b', 'x'] = 551

In [26]:
df

     u    v    w    x    y    z
a  684  559  629  192  835  763
b  707  359    9  551  277  754
c  804  599   70  472  600  396
d  314  705  486  551   87  174
e  600  849  677  537  845   72
f  777  916  115  976  755  709

In [27]:
df.nlargest(3, columns='x')

     u    v    w    x    y    z
f  777  916  115  976  755  709
b  707  359    9  551  277  754
d  314  705  486  551   87  174

In [28]:
df.nlargest(3, columns=['x', 'y'])

     u    v    w    x    y    z
f  777  916  115  976  755  709
b  707  359    9  551  277  754
d  314  705  486  551   87  174

In [29]:
df.nlargest(3, columns=['x', 'w'])

     u    v    w    x    y    z
f  777  916  115  976  755  709
d  314  705  486  551   87  174
b  707  359    9  551  277  754

In [31]:
%timeit s.nlargest(3)

319 µs ± 8.97 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [32]:
%timeit s.sort_values().tail(3)

75.2 µs ± 556 ns per loop (mean ± std. dev. of 7 runs, 10,000 loops each)